src/Openfoam/unitCubefine/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  2312                                  |
|   \  /    A nd           | Website:  www.openfoam.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (50 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (50 0 0);
    }

    outlet
    {
        type            zeroGradient;
    }

    bottom
    {
        type            fixedValue;
        value           uniform (50 0 0);
    }

    top
    {
        type            symmetryPlane;
    }

    front
    {
        type            symmetryPlane;
    }

    back
    {
        type            symmetryPlane;
    }

    Geometry
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

}
